# Уставшие от необычно теплой зимы, жители решили узнать, действительно ли это самая длинная оттепель за всю
# историюнаблюдений за погодой. Они обратились к синоптикам, а те в свою очередь, занялись исследованием статистики за
# прошлые годы. Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период, в который
# среднесуточная температура ежедневно превышала 0 градусов Цельсия.
# Напишите программу, помогающую синоптикам в работе.
# Пользователь вводит число N - общее количество рассматриваемых дней от 1 до 100. в сдедующих строках располагается N
# целых чисел.
# Каждое число - среднесуточная температура в соответствующий день. температура от -50 до 50
#
# input 6 -> -20 30 -40 50 10 -10
# output 2

