from random import randint
# Урок 3. Списки и словари
# Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# ----------------------------------------------------------------------------------------------------------------------
list_length1 = int(input("Insert length of list: "))
nums1 = [randint(1, 10) for i in range(list_length1)]
count1 = 0
for i in range(len(nums1)):
    if i % 2 != 0:
        count1 += nums1[i]
print(f"{nums1}\nСумма элементов, стоящих на нечетных позициях = {count1}")
# ======================================================================================================================
# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
# ----------------------------------------------------------------------------------------------------------------------
list_length2 = int(input("Insert length of list: "))
nums2 = [randint(1, 10) for i in range(list_length2)]
results = []
k = 0
if list_length2 % 2 != 0:
    k = list_length2 // 2 + 1
else:
    k = list_length2 / 2
for i in range(int(k)):
    results.append(nums2[i] * nums2[-1 - i])
print(f"{nums2} => {results}")

# ======================================================================================================================
# Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# [1.1, 1.2, 3.1, 5, 10.01] => 0.19
# ----------------------------------------------------------------------------------------------------------------------
floats = [1.1, 1.2, 3.1, 5, 10.01]
min = 0.99
max = 0
result = 0
for i in range(len(floats)):
    if floats[i] % 1 != 0:
        if floats[i] % 1 < min:
            min = round((floats[i] % 1), 2)
            print(min)
        if floats[i] % 1 > max:
            max = round((floats[i] % 1), 2)
            print(max)
result = max - min
print(f"{floats} => {result}")

# ======================================================================================================================
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
# ----------------------------------------------------------------------------------------------------------------------
num = int(input("Insert your number: "))
result = ''
# i = 0
while num:
    result += str(num % 2)
    num //= 2
print(result[::-1])

# ======================================================================================================================
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21][Негафибоначчи]
#-----------------------------------------------------------------------------------------------------------------------
n = int(input("n =: "))
num1_1 = 0
num2_1 = 1
fib = []
fib.append(num1_1)
fib.append(num2_1)
for i in range(2, n +1):
    num1_1, num2_1 = num2_1, num1_1 + num2_1
    fib.append(num2_1)
# Fn = F(n+2)−F(n+1)
num1_2 = 1
num2_2 = -1
fib_neg = []
fib_neg.insert(0, num1_2)
fib_neg.insert(0, num2_2)
for i in range(2, n):
    num1_2, num2_2 = num2_2, num1_2 - num2_2
    fib_neg.insert(0, num2_2)
#----------------------------------------------------------
negafib = fib_neg + fib
print(negafib)
